MongoDB/Workload B/Output_Test2_LOAD.txt
ava -cp /home/ubuntu/ycsb-0.17.0/mongodb-binding/conf:/home/ubuntu/ycsb-0.17.0/conf:/home/ubuntu/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-04-09 20:18:50:239 0 sec: 0 operations; est completion in 0 second
mongo client connection created with mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-04-09 20:18:57:303 7 sec: 1000 operations; 140.43 current ops/sec; [CLEANUP: Count=1, Max=8003, Min=8000, Avg=8002, 90=8003, 99=8003, 99.9=8003, 99.99=8003] [INSERT: Count=1000, Max=139007, Min=3300, Avg=6431.69, 90=8551, 99=14335, 99.9=21407, 99.99=139007]
[OVERALL], RunTime(ms), 7122
[OVERALL], Throughput(ops/sec), 140.40999719180004
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 39
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5475989890480202
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 39
[TOTAL_GC_TIME_%], Time(%), 0.5475989890480202
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 8002.0
[CLEANUP], MinLatency(us), 8000
[CLEANUP], MaxLatency(us), 8003
[CLEANUP], 95thPercentileLatency(us), 8003
[CLEANUP], 99thPercentileLatency(us), 8003
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 6431.687
[INSERT], MinLatency(us), 3300
[INSERT], MaxLatency(us), 139007
[INSERT], 95thPercentileLatency(us), 10559
[INSERT], 99thPercentileLatency(us), 14335
[INSERT], Return=OK, 1000